import Icon from "@icons/task-square.svg";
import Right from "@icons/chevron-right.svg";


const Rules = () => {
    return (
        <>
            <main dir="rtl">
                <div className="container pt-8 px-4">
                    <div className="flex items-center lg:justify-center w-full mb-10">
                        <div className="centerOfParent gap-3">
                            <div className="centerOfParent"><Icon className='lg:block hidden' /> <Right className='lg:hidden fill-primary-700' /></div>
                            <h1 className="font-semibold lg:text-xl sm:text-base text-sm">قوانین و شرایط</h1>
                        </div>
                    </div>
                    <ol className="lg:text-base sm:text-sm text-xs flex flex-col gap-1 list-disc text-natural_gray-950 leading-[26px] *:w-full [&>li>p]:text-justify">
                        <li>
                            <p>هرگونه استفاده از خدمات لینگومسترز به معنی پذیرفتن شرایط مندرج در سایت لینگومسترز می‌باشد. سایت لینگومسترز هیچ توافقی با اساتید خارج از این شرایط ندارد.      شرایط و قوانین زیر مربوط به تمام اساتیدی است که به هر شکلی با لینگومسترز همکاری و از خدمات آن استفاده می‌کنند.</p>
                        </li>
                        <li>
                            <p>علیرغم تمام تلاش های تیم لینگو مسترز برای راستی آزمایی هویت و اطلاعات ارائه شده توسط اساتید و زبان آموزان، مجددا لینگومسترز هیچ مسئولیت یا تعهدی در قبال      اطلاعات ارائه شده توسط اساتید و زبان آموزان چه از طریق تماس تلفنی و چه از طریق ارسال درخواست معرفی استاد از طریق سایت ندارد.</p>
                        </li>
                        <li>
                            <p>لینگومسترز مختار است که هر گونه اطلاعات و عکسی که توسط اساتید به سایت ارسال می‌شود یا هر حساب کاربری و اطلاعات دیگری که مربوط به اساتید یا ایجاد شده توسط اساتید باشد را هر زمانی و به هر شکلی که ضروری بداند، اصلاح یا حذف نماید.</p>
                        </li>
                        <li>
                            <p>لینگومسترز هیچ قرارداد، تعهدنامه یا سندی را با هیچ شخص حقیقی یا حقوقی در حوزه تدریس خصوصی منعقد نکرده است. علیرغم تمام تلاش های تیم لینگومسترز برای راستی آزمایی اطلاعات درج شده در پروفایل اساتید، لینگومسترز هیچ‌گونه مسئولیتی در قبال اطلاعات درج شده در پروفایل اساتید نخواهد داشت و صرفا مطالب درج شده      توسط اساتید را نمایش می‌دهد.</p>
                        </li>
                        <li>
                            <p>تعداد جلساتی که برگزار خواهند شد برابر تعداد کلاس های رزرو شده از وبسایت لینگومسترز خواهد بود. اگر استادی چه به صورت سرخود و چه با تبانی با زبان آموز سعی در برگزاری کلاس بدون رزرو در وبسایت لینگومسترز نماید تا از پرداخت هزینه به لینگومسترز خودداری نماید، لینگومسترز این حق را برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص پروفایل، سابقه همکاری و اعتبار مالی و قطع همکاری با اساتید و زبان آموزان در سایت اقدام نماید.</p>
                        </li>
                        <li>
                            <p>لینگومسترز مختار است مبلغ حق معرفی و هماهنگی را در اسرع وقت و مطابق با دستور‌العمل‌های ابلاغی خود، از دریافتی زبان آموزان کسر و مابقی را بسته شرایط، سیاست های کاری و تصمیم مدیریت لینگومسترز به صورت روزانه، هفتگی و یا ماهانه در وجه استاد واریز نماید.</p>
                        </li>
                        <li>
                            <p>لینگومسترز هیچ قرارداد، تعهدنامه یا سندی با هیچ موسسه یا نهاد آموزشی منعقد نکرده است. لذا در صورتی که اساتید با موسسه‌ یا نهاد آموزشی که خود را طرف قرارداد آن      می‌داند، همکاری نماید، تمام مسئولیت‌ها با خود استاد مربوطه است و لینگومسترز هیچ تعهد یا مسئولیتی در قبال خسارات مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از ارتباط استاد با موسسه یا نهاد آموزشی مربوطه نخواهد داشت.</p>
                        </li>
                        <li>
                            <p>کارشناسان و سیستم سایت لینگومسترز تمام تلاش خود را برای اخذ اطلاعات کامل از زبان آموزان و همچنین اساتید می‌کنند و موارد امنیتی در خصوص معرفی استاد به زبان      آموز و بالعکس را رعایت می‌نماید. با این وجود، اساتید و زبان آموزان با مسئولیت خود برای تدریس و یا یادگیری به محل مربوطه که می تواند آموزشگاه، محل کار زبان آموز، منزل زبان آموز و یا منزل استاد به توافق می رسند و مراجعه می‌کنند و لینگومسترز هیچ تعهد یا مسئولیتی در قبال خسارات مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از ارتباط بین استاد با زبان آموز نخواهد داشت. به عبارتی لینگومسترز صرفا ارتباط بین استاد و زبان آموز را هماهنگ می‌کند و به هیچ عنوان تضمینی در مورد نیات و قصد زبان آموز به استاد و بالعکس نمی‌تواند ارائه نماید.</p>
                        </li>
                        <li>
                            <p>درصورتی که زبان آموزی پس از خرید و رزرو تعداد جلسات مشخص شده‌ نسبت به تمدید کلاس‌ها، در خارج از وبسایت اقدام نماید، استاد موظف است این موضوع را به اطلاع لینگومسترز برساند. حتی در صورتی که زبان آموز پس از مدت زمانی وقفه اقدام به تمدید کلاس نماید، استاد موظف است که لینگومسترز را در جریان تمدید کلاس‌ها قرار دهد.      درصورتی که استاد به هر دلیلی تمدید کلاس را به لینگومسترز اطلاع ندهد، لینگومسترز این حق را برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص پروفایل،      سابقه همکاری و اعتبار مالی اساتید در سایت اقدام نماید.</p>
                        </li>
                        <li>
                            <p>درصورتی که استادی در حین و یا پس از تدریس کلاس های خریداری و رزرو شده توسط زبان آموزان‌ پیشنهاد به ادامه کلاس‌ها در خارج از وبسایت لینگومسترز را بدهد، زبان آموز موظف است در اسرع وقت این موضوع را به اطلاع لینگومسترز برساند. حتی در صورتی که استاد پس از مدت زمانی وقفه اقدام به پیشنهاد کلاس در خارج از وبسایت لینگومسترز نماید، زبان آموز موظف است که لینگومسترز را در جریان تمدید کلاس‌ها قرار دهد. در صورتی که زبان آموز به هر دلیلی تمدید کلاس را به لینگومسترز اطلاع ندهد، لینگومسترز این حق را برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص پروفایل و اعتبار مالی یا عدم ارائه خدمات به زبان آموز در سایت اقدام نماید.</p>
                        </li>
                        <li>
                            <p>درصورتی که زبان آموز از استاد مربوطه بخواهد که دروس دیگری را که خریداری نشده اند را نیز به زبان آموز تدریس کند، استاد موظف است این کار را با کسب اجازه از لینگومسترز و اطلاع‌رسانی به سایت لینگومسترز انجام دهد. در صورتی که استاد به هر دلیل اطلاع‌رسانی نکند، لینگومسترز این حق را برای خود محفوظ می‌داند که نسبت به      هرگونه عملی در خصوص پروفایل، سابقه همکاری و اعتبار مالی اساتید در سایت اقدام نماید.</p>
                        </li>
                        <li>
                            <p>اکیدا لازم و ضروری است که استاد در خصوص تعهدات خود نسبت به زبان آموز پایبند باشد. تماس سریع با زبان آموز در زمان معرفی، پاسخ‌گویی به تماس‌های زبان آموز پیش از جلسه اول و پس از آن، عدم دریافت هیچگونه وجه اضافی به هر میزان و نحوی و سایر توافقات از جمله تعهدات استاد نسبت به زبان آموز می‌باشد.</p>
                        </li>
                        <li>
                            <p>برای امنیت خود و جلوگیری از ضرر و زیان لطفا به هیچ وجه در خارج از سایت لینگومسترز هیچ مبلغی را به اساتید پرداخت نکنید. پرداخت از طریق لینگومسترز تنها روش تضمین جلوگیری از بدقولی، کیفیت کلاس ها و جلوگیری از سوء استفاده های احتمالی می‌باشد. لینگومستزر پس از اطمینان از تشکیل کلاس ها، پس از کسر هزینه معرفی و کارمزد مبلغ را در وجه استاد واریز خواهد کرد.</p>
                        </li>
                        <li>
                            <p>درصورت مشاهده تخلف یا تلاش برای سوءاستفاده از تضمین درستی رزومه‌ها، حق عدم پذیرش آن درخواست برای لینگومسترز محفوظ است. لینگومسترز می‌تواند در هر زمان به تشخیص خود شرایط تضمین‌ها را تغییر داده یا ارائه آن را متوقف کند. در موارد اختلاف، مدیریت لینگومسترز تصمیم گیرنده نهایی خواهد بود.</p>
                        </li>
                        <li>
                            <p>مدت زمان هر کلاس بیست و پنج دقیقه می باشد. چنانچه زبان آموز دو و یا چند جلسه رو به طور متوالی رزرو کرده باشد، استاد، یا زبان آموز و یا هر دو می تواند پنج دقیقه به ازای هر کلاس تدریس شده از کلاس خارج شوند و بلافاصه رأس ساعت کلاس بعدی حاضر شوند و یا در صورت تمایل بدون استراحت به ازای هر کلاس رزرو شده بیست و پنج دقیقه و در مجموع پنجاه، هفتاد و پنج دقیقه و ... کلاس حضور داشته باشند.</p>
                        </li>
                        <li>
                            <p>برای کلاس های حضوری، زبان آموز بایستی اطلاعات هویتی مانند عکس، تصویر روی کارت ملی، آدرس، تلفن ثابت و همراه خود و ... را در وبسایت وارد نماید.</p>
                        </li>
                        <li>
                            <p>
                                برای تدریس در لینگومسترز، استاد بایستی اطلاعات هویتی، عکس، تصویر روی کارت ملی، آدرس، تلفن ثابت و همراه، مدارک تحصیلی و ... را در وبسایت وارد نماید و پس از تایید توسط پشتیبانی لینگومسترز استاد می تواند تدریس را شروع کند.
                                <br />
                                تنها زبان آموزان خانم، می‌توانند از خدمات برای کلاس های حضوری، اساتید خانم لینگومسترز استفاده نمایند. به عبارتی درصورتی که فردی که درخواست را ثبت می‌کند، آقا باشد
                                امکان رزرو استاد خصوصی خانم برایش مقدور نمی باشد.</p>
                        </li>
                        <li>
                            <p>چه استاد و چه زبان آموز، هر دو طرف در صورت بروز هرگونه پیشامد ناخواسته که منجر به عدم حضور رأس ساعت کلاسی شود، بایستی در اسرع وقت موضوع را به لینگومسترز اطلاع دهند.</p>
                        </li>
                        <li>
                            <p>
                                <strong>قوانین لغو کلاس</strong>
                                <br />
                                لغو اضطراری کلاس توسط استاد یا زبان آموز در صورتی که در صورت ارائه گواهی مستند مانند گواهی پزشکی و ...، بدون هیچگونه جریمه ای خواهد بود.
                                <br />
                                لغو کلاس توسط استاد یا زبان آموز در صورتی که بیش از 24 ساعت به شروع کلاس مانده باشد، بدون هیچگونه جریمه خواهد بود و در این حالت اعتبار زبان آموز به اندازه مبلغ کلاس لغو شده ،افزایش می یابد و زبان آموز می تواند هر زمانی که بخواهد با همان استاد و یا استاد دیگری کلاس دیگری را رزرو کند.
                                <br />
                                در صورتی که کمتر از 24 ساعت به شروع کلاس مانده باشد، میزان جریمه ها طبق جداول زیر محاسبه و در اعتبار مالی مربوطه اعمال خواهد شد.
                                <br />
                                در صورتی که لغو کلاس از طرف استاد باشد، کل مبلغ کلاس به اعتبار زبان آموز اضافه می گردد و زبان آموز در اسرع وقت از لغو کلاس مطلع خواهد شد.
                            </p>
                        </li>
                        {/* <li>
                            <p></p>
                        </li> */}
                    </ol>
                    <div className="my-20 overflow-x-auto">
                        <table className="min-w-full table-auto border-collapse border border-natural_gray-400 bg-natural_gray-50 lg:text-base sm:text-xs text-[10px]">
                            <thead>
                                <tr>
                                    <th colSpan="2" className="border border-natural_gray-400 py-4 text-center">
                                        لغو کلاس توسط استاد
                                    </th>
                                </tr>
                                <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center">
                                    <th>زمان لغو</th>
                                    <th>کاهش اعتبار مالی استاد و پرداخت به لینگومسترز</th>
                                </tr>
                            </thead>
                            <tbody className="[&>tr>td]:border [&>tr>td]:border-b [&>tr>td]:border-natural_gray-400 [&>tr>td]:py-4 [&>tr>td]:text-center">
                                <tr>
                                    <td>۳ ساعت و کمتر از آن</td>
                                    <td>۵۰% مبلغ کلاس</td>
                                </tr>
                                <tr>
                                    <td>بیشتر از ۳ ساعت و کمتر از ۱۲ ساعت</td>
                                    <td>۲۰% مبلغ کلاس</td>
                                </tr>
                                <tr>
                                    <td>بین ۱۲ تا ۲۴ ساعت</td>
                                    <td>۱۵% مبلغ کلاس</td>
                                </tr>
                                <tr>
                                    <td>بیش از ۲۴ ساعت</td>
                                    <td>بدون کاهش اعتبار</td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <div className="my-20 overflow-x-auto">
                        <table className="min-w-full table-auto border-collapse border border-natural_gray-400 bg-natural_gray-50 lg:text-base sm:text-xs text-[10px]">
                            <thead>
                                <tr>
                                    <th colSpan="4" className="border border-natural_gray-400 py-4 text-center">
                                        لغو کلاس توسط دانش آموز
                                    </th>
                                </tr>
                                <tr className="[&>th]:lg:border-s [&>th]:border-b [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center">
                                    <th className="border-l">زمان لغو</th>
                                    <th>کاهش اعتبار مالی دانش آموز</th>
                                    <th>پرداختی به استاد</th>
                                    <th>پرداختی به لینگو مسترز</th>
                                </tr>
                            </thead>
                            <tbody className="[&>tr>td]:lg:border-l [&>tr>td]:lg:border-b-0 [&>tr>td]:border-b [&>tr>td]:border-natural_gray-400 [&>tr>td]:py-4 [&>tr>td]:text-center">
                                <tr>
                                    <td className="border-l">۳ ساعت و کمتر از آن</td>
                                    <td>۱۰۰% مبلغ کلاس</td>
                                    <td>۶۵%</td>
                                    <td>۳۵%</td>
                                </tr>
                                <tr>
                                    <td className="border-l">بیشتر از ۳ ساعت و کمتر از ۱۲ ساعت</td>
                                    <td>۶۰% مبلغ کلاس</td>
                                    <td>۳۵%</td>
                                    <td>۲۵%</td>
                                </tr>
                                <tr>
                                    <td className="border-l">بین ۱۲ تا ۲۴ ساعت</td>
                                    <td>۴۰% مبلغ کلاس</td>
                                    <td>۲۵%</td>
                                    <td>۱۵%</td>
                                </tr>
                                <tr>
                                    <td className="border-l">بیشتر از ۲۴ ساعت</td>
                                    <td>بدون کاهش اعتبار</td>
                                    <td>۰%</td>
                                    <td>۰%</td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <ol className="lg:text-base sm:text-sm text-xs flex flex-col gap-1 list-disc text-natural_gray-950 leading-[26px] *:w-full [&>li>p]:text-justify">
                        <li>
                            <p>قوانین غیبت از کلاس</p>
                        </li>
                        <li>
                            <p>در صورتی که زبان آموز ظرف مدت 3 دقیقه از شروع کلاس، سر کلاس حاضر نشود، استاد بایستی پشتیبانی را جهت تماس با زبان آموز مطلع نماید و در کل طول کلاس منتظر زبان آموز بماند در این صورت، چه زبان آموز سر کلاس حاضر شود و یا چه حاضر نشود، استاد کل مبلغ کلاس را دریافت خواهد کرد. در صورتی که کلاس را ترک کند هیچ مبلغی دریافت نخواهد کرد.</p>
                        </li>
                        <li>
                            <p>در صورتی که استاد ظرف مدت 3 دقیقه از شروع کلاس، سر کلاس حاضر نشود، زبان آموز بایستی پشتیبانی را جهت تماس با استاد مطلع نماید و تا دو دقیقه در کلاس منتظر استاد بماند در صورتی که استاد تا 5 دقیقه اول کلاس سر کلاس حاضر نشود، زبان آموز می تواند مطلع کردن پشتیبان کلاس را ترک نماید در این صورت کلاس لغو و کل مبلغ کلاس را با افزایش میزان اعتبار دریافت خواهد کرد. غیبت استاد به او تذکر داده شده و در پرونده اش درج و در پروفایلش در قسمت میزان حضور در کلاس اعمال خواهد شد و ن باعث می شود تا سایر زبان آموز در مورد پایبند بودن استاد به زمان بندی دید بهتری داشته باشند.</p>
                        </li>
                        <li>
                            <p>در صورت تکرار غیبت ها توسط استاد، لینگومسترز مختار است تا هرگونه تصمیم مقتضی را که صلاح بداند مانند جریمه مالی، قطع همکاری و ... اعمال نماید.</p>
                        </li>
                        <li>
                            <p>لطفا در صورت مشاهده هرگونه سو استفاده یا درخواست تماس و پرداخت خارج از لینگومسترز یا هرگونه ابهام و سوال با پشتیبانی لینگومسترز تماس بگیرید.</p>
                        </li>
                        <li>
                            <p>زبان آموزان نباید به هیچ عنوان هیچگونه وجه اضافی در وجه اساتید واریز کنند.</p>
                        </li>
                    </ol>
                </div>
            </main>
        </>
    );
};

export default Rules;
